#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/55d3be31-4d42-42c1-8129-a75a80d3140b/resourceGroups/rg-module-dinkoli]
module.storage.azurerm_storage_account.account: Refreshing state... [id=/subscriptions/55d3be31-4d42-42c1-8129-a75a80d3140b/resourceGroups/rg-module-dinkoli/providers/Microsoft.Storage/storageAccounts/moduledinkolstorage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.azurerm_subnet.mysubnet will be created
  + resource "azurerm_subnet" "mysubnet" {
      + address_prefixes                              = [
          + "192.168.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dinko-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-module-dinkoli"
      + virtual_network_name                          = "dinko-vnet"
    }

  # module.network.azurerm_virtual_network.myvnet will be created
  + resource "azurerm_virtual_network" "myvnet" {
      + address_space                  = [
          + "192.168.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "dinko-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-module-dinkoli"
      + subnet                         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @dinkol, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan and apply with OIDC auth`*